void main() {
  // Завдання 1: Математичні оператори
  // 1) Створіть змінні довжина і ширина прямокутника (ширина 18.4, висота 30.9)
  // Де width - ширина, height - висота.
  // 2) Обчисліть площу і периметр прямокутника.
  // Де p - периметр, s - площа.
  // 3) Виведіть площу і периметр.
  // 4) Використайте оператор ~/ для обчислення скільки повних квадратів 1х1 вміщається у площу.
  // Де squares - кількість повних квадратів 1х1 вміщується у площу прямокутника.

  double width = 18.4;
  double height = 30.9;

  double p = 2 * (width + height);
  double s = width * height;

  print('p = $p');
  print('s = $s');
  print('squares = ${s ~/ 1}');
}
